Repository: eGovPDX/portlandor
Catalog: translations/anonymous_login-8.x-2.0.*.po
Languages: uk

source: About
uk: Про модуль

source: Uses
uk: Використання

source: Exclude paths
uk: Шляхи-винятки

source: Page paths
uk: Шляхи сторінок

source: Anonymous login
uk: Анонімний вхід

source: Login message
uk: Повідомлення входу

source: Optionally provide a message that will be shown to users when they are redirected to login.
uk: Вкажіть необов'язкове повідомлення, показуване користувачам, що переспрямовуються на вхід.

source: This module will redirect anonymous users to the login page whenever they reach any admin-specified page paths, and will direct them back to the originally-requested page after successful login.
uk: Цей модуль переспрямовує анонімних користувачів на сторінку входу, коли вони відвідують сторінки, визначені адміністратором, і повертає їх на сторінку, яка запитувалася, після успішної авторизації.

source: Include paths
uk: Шляхи-включення

source: Included paths are those that will redirect the user to the login page.<br/>Simply enter <em>"*"</em> as the only path to redirect and all anonymous traffic will be redirected to the login page. With this module enabled and configured to act on <em>node/*/edit</em> paths, if a user clicks a link to <em>site.com/node/123/edit</em>, they will be redirected to <em>site.com/user/login?destination=node/123/edit</em>.
uk: Шляхи-включення - з них користувач буде переспрямовуватись на сторінку входу.<br/> Просто введіть <em>"*"</em> як єдиний шлях до переспрямоування, і весь анонімний трафік буде переспрямований на сторінку входу. Якщо цей модуль увімкнуто та налаштовано на роботу з шляхом<em>node/*/edit</em>, то користувач, що натискає посилання <em>site.com/node/123/edit</em>, буде переспрямований на <em>site.com/user/login?destination=node/123/edit</em>.

source: Excluded paths are those that will not redirect the user.<br/>Prefix a path with <em>"~"</em> to exclude it from being redirected.
uk: Шляхи-виключення не переспрямовують користувача.<br/> Введіть на початку шляху <em> "~" </ em>, щоб запобігти його переспрямуванню.

source: Anonymous Login
uk: Анонімний вхід

source: Specify pages that when visited by anonymous users will be forced to login.
uk: Вкажіть сторінки, з яких анонімні користувачі будуть переспрямовані на вхід.

source: Configure anonymous login redirect settings.
uk: Сконфігуруйте налаштування переспрямування анонімного входу.

source: Anonymous login settings.
uk: Налаштування Анонімного входу.

source: Anonymous login page paths.
uk: Шляхи до сторінок Анонімного входу.

source: Site login page path.
uk: Шлях до сторінки входу на сайт.

source: Anonymous login message.
uk: Повідомлення анонімного входу.

source: Enter a list of page paths that will force anonymous users to login before viewing. After logging in, they will be redirected back to the requested page. Enter each path on a different line. Wildcards (*) can be used. Prefix a path with ~ (tilde) to exclude it from being redirected.
uk: Введіть список шляхів, з яких анонімних користувачів буде переспрямовано на вхід перед переглядом. Після входу вони будуть переспрямовані назад на запитану сторінку. Введіть кожен шлях з нового рядка. Можна використовувати символи підстановки (*). Почніть шлях з ~ (тільда), щоб виключити можливість його переспрямування.

source: Login page path
uk: Шлях до сторінки входу

source: Enter the user login page path of your site.
uk: Введіть шлях до сторінки входу користувача на вашому сайті.

source: Login page path is invalid. Check it please.
uk: Шлях до сторінки входу хибний. Перевірте його, будь ласка.
